import {Component, OnDestroy, OnInit} from '@angular/core';
import {MainService} from "./main.service";

declare var window : any;

@Component({
	selector: 'app-root',
	templateUrl: 'app.component.html'
})
export class AppComponent implements OnInit, OnDestroy
{
	state = 'LOADING';

	remote = window.require('electron').remote;

	errorText = '';

	connectorForEdit = null;

	constructor (private service : MainService)
	{
		this.setError = this.setError.bind(this);
	}

	async ngOnInit ()
	{

		console.log(await this.service.convert1stTo3rd('Я 11.01.2009 года около 23 часов вышел в коридор покурить, сидел на корточках возле квартиры. Мимо проходил Б. и ни слова не сказал, ударил меня ногой, обутой в зимний ботинок, в челюсть, от удара я упал. Когда встал и догнал Б., последний развернулся, между ними произошла борьба, в ходе которой я ударил его 2 раза кулаком по лицу, и понял, что не справлюсь с Б. и ушел домой.  У меня шла кровь, был выбит зуб.  На следующий день я не смог глотать, обратился  в больницу, где ему сделали рентген, обнаружили перелом челюсти. До  02 февраля 2009 года я лежал в больнице, а до 03 марта 2009 года у меня был больничный. Ранее подсудимого не знал, видел на массиве, но не общался, неприязненных отношений у меня к не было, конфликта в тот день не происходило'));
		//this.service.convert1stTo3rd('Я увидела, что Иванов пошёл ко мне. Он повысил на меня голос. Это был удар по моему самолюбию. Я вообще забыла все местоимения: я, мой, моему, моё, меня, мне, мной, мною');
		console.log(await this.service.convert1stTo3rd('По существу заданных вопросов могу пояснить, что по вышеуказанному адресу проживаю с родителями Совуновой Аллой Николаевной и Совуновым Вадимом Евгеньевичем. В свободное от обучения в средней общеобразовательной школе № 96 время он занимается в цирковой студии «Престиж», с которой периодически выступаю, в том числе с выездом. Так, 11.05.2015 года я с напарником по цирковой студии Галич Денисом Юрьевичем поехали в г. Челябинск на выступление в ледовой арене «Трактор». 19.05.2015 года я с Галич Д.Ю. возвращались обратно в г. Омск, для чего на станции Челябинск мы осуществили посадку в пассажирский поезд № 098 сообщением «Кисловодск-Тында» в вагон № 14 на места № 22, 24, 26. На одном месте находился реквизит. Осуществив посадку и заняв свои места они легли спать, телефон был все время при нему, однако перед тем как лечь спать он выключился, т.к. сел заряд аккумулятора. Проснувшись утром по станции Петропавловск они находились на своих местах, так как в вагоне работали пограничники, проводили проверку пассажиров. В вагоне было много пассажиров, некоторые из них в пути следования распивали спиртные напитки. В том числе в вагоне из числа пассажиров были военнослужащие, других отличительных признаков он не запомнила. После того как проводник прошел по вагону и предупредил, что до станции Омск оставалось около 15 минут, он решила пойти поставить свой мобильный телефон на зарядку для того, чтобы позвонить маме и сказать о прибытии поезда. Так, он прошла в нерабочий тамбур, где напротив туалета над окном поставила свой мобильный телефон заряжаться, положив его на верхний уступ окна. В момент, когда он ставила телефон на зарядку, в тамбуре напротив туалета стоял проводник вагона, он видел все его действия. Проводник дожидался пассажира, который находился в туалете, для того чтобы закрыть туалет перед прибытием на станцию Омск. Поставив телефон на зарядку он решила вернуться на свое место, через минуту за ним вышел из тамбура и проводник и прошел к себе. Он находилась на свое месте около 7-10 минут, после чего решила проверить свой мобильный телефон. Также у него вызвала подозрение женщина, на вид цыганка, которая прошла в сторону туалета. Так, подойдя к нерабочему тамбуру он увидела, что в розетке осталось только зарядное устройство от его мобильного телефона, самого телефона не было. Он сразу поняла, что его похитили и пошла к проводнику, сообщила о случившемся, на что проводник ответил что по станции Омск вызовет сотрудников полиции для разбирательств. По прибытию на станцию Омск в вагон зашли сотрудники полиции , которым он указала на место где стоял телефон на зарядке и устно объяснила, что случилось. После этого он сошла по станции Омск вместе с одним из сотрудников полиции и проследовали в дежурную часть Омского ЛУ МВД России, где в присутствии мама – Совуновой Аллы Николаевны он написала заявление и его опросили сотрудники полиции по факту случившегося. Также поясняю, что мобильный телефон у него был марки «Iphone» модель «4s», IMEI 013532009242428 в корпусе белого цвета. На момент хищения мобильный телефон находился в чехле черного цвета, на задней стенке чехла изображена девушка с фотоаппаратом. Телефон не имел трещин, сколов иных механических повреждений. Мобильный телефон приобретался за 18 000 рублей примерно в сентябре 2014 года, при этом в данную сумму входила его настройка. В настоящее время с учетом износа, я оцениваю мобильный телефон в 13 500 рублей 00 копеек, как указано в чеке, который я готова выдать. Чехол для меня материальной ценности не представляет. На момент хищения в мобильном телефоне находилась сим-карта оператора ОАО «МТС» с абонентским номером +79835288572. Симкарта материальной ценности сим-карта для него не представляет, денежных средств на момент хищения на сим-карте не было. Данный абонентский номер оформлен на его папу – Совунова Вадима Евгеньевича. Также хочу пояснить, что за выступления в цирковой группе он получаю денежные средства. Оплата за наши выступления сдельная, выступаем на бездоговорной основе. В среднем один час выступления стоит от 1 500 рублей, в зависимости от сложности номера. В месяц примерно он зарабатываю от 8 000 до 10 000 рублей. Именно с данных денежных средств был куплен похищенный у него мобильный телефон, кроме того, из заработанных денег - часть заработка идет на оплату поездок, покупку билетов на транспорт, поэтому, в силу того, что он еще обучается в школе, постоянного заработка не имею, и нахожусь на иждивении родителей в связи с чем, ущерб на сумму 13 500 рублей 00 копеек причиненный ему, является для него значительным. Мобильный телефон покупался в рассрочку, которая была оформлена на мою маму – Совунову А.Н., однако денежные средства вносила он, по мере их получения за выступления. В настоящее время при нему находится коробка от мобильного телефона марки «Iphone» модель «4s», IMEI 013532009242428 в корпусе белого цвета, два электронных билета на листах А4, копия свидетельства о рождении на мое имя, а также электронная выписка чека из магазина «Связной» и документы из магазина, где приобретали мобильных телефон. Данные предметы и документы он готова выдать. Больше по данному факту ему пояснить нечего.'));


		this.getSettings();
		this.service.currentTokenUpdated$.subscribe(newToken =>
		{
			if (newToken === null)
			{
				this.service.settings.accessToken = null;
				this.state = "AUTH";
				this.service.saveSettings();
			}
		});
	}

	getSettings ()
	{
		this.service.getSettings().then(settings => {

			this.service.settings = {...this.service.settings, ...settings};
			this.service.token = this.service.settings.accessToken;
			this.state = "DASHBOARD";
			//this.state = "PROMO";

			this.service.refreshConnectorsShortcuts();

		}).catch(this.setError);
	}

	onAuth ({accessToken, email})
	{
		this.service.settings = {
			...this.service.settings,
			accessToken,
			email
		};
		this.state = "LOADING";

		this.service.token = accessToken;
	}

	onLogout ()
	{
		this.service.settings = {
			...this.service.settings,
			accessToken: null,
			email: null
		};
		this.service.saveSettings();
		this.state = "AUTH";
	}

	setError (error)
	{
		this.state = "ERROR";
		this.errorText = error;
	}

	returnFromConnectorDetails ()
	{
		this.connectorForEdit = null;
		this.state = 'DASHBOARD';
	}

	openConnectorEdit (connectorForEdit)
	{
		this.connectorForEdit = connectorForEdit;
		this.state = 'CONNECTOR';
	}

	openConnectorTest (connectorForEdit)
	{
		this.connectorForEdit = connectorForEdit;
		this.state = 'TEST';
	}

	ngOnDestroy(): void
	{
		this.service.cancelConnectorsShortcuts();
	}

	toAuth ()
	{
		if (this.state === "AUTH")
		{
			this.state = "DASHBOARD";
		}
		else
		{
			this.state = "AUTH";
		}
	}
}
